snlkuharlocal/src/Documents/ЗаявкаНаОтгрузку/ЗаявкаНаОтгрузку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаОтгрузку</name>
  <basedOn>Document.ЗаявкаНаОтгрузку</basedOn>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОтгрузку</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗаявки</name>
    <type>
      <types>EnumRef.ВидыЗавокНаОтргузку</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Накладные</name>
    <attributes>
      <name>Отправитель</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставкиОтправитель</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортнаяКомпанияОтправитель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктПерегрузаОтправитель</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставкиПолучатель</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортнаяКомпанияПолучатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктПерегрузаПолучатель</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНакладной</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль</name>
      <type>
        <types>CatalogRef.Автомобили</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>РайонДоставкиПолучатель</name>
      <type>
        <types>CatalogRef.РайоныДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеНакладной</name>
      <type>
        <types>EnumRef.СостоянияНакладной</types>
      </type>
    </attributes>
    <attributes>
      <name>Доставлена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеОтгружать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресОтправитель</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресПолучатель</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef.ЗаявкаВТранспортныйОтдел</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.РасходМатериаловИТары</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДоставки</name>
      <type>
        <types>EnumRef.ТипыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКоробок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>CatalogRef.Регионы</types>
      </type>
    </attributes>
    <attributes>
      <name>СкладСамовывоза</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>РайонДоставкиОтправитель</name>
      <type>
        <types>CatalogRef.РайоныДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьАвтоЗаДень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьКилометража</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьТТНзаРНК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьТТНзаФактАдрес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДопРасходов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КилометражЗаМкад</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРазгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеДоставки</name>
      <type>
        <types>EnumRef.СостояниеДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомерОтгрузки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопИнфо</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоставкаЗаНашСчет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортныйОтдел</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерРейсаАнтор</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДоставки</name>
      <type>
        <types>EnumRef.ПризнакиДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриемки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПриемки</name>
      <type>
        <types>CatalogRef.ВремяПриемки</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСФ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокументаБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Распределена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВЛЗ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Распределил</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомерЗагрузкиМашины</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерХодки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль2</name>
      <type>
        <types>CatalogRef.Автомобили</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПаллет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВодительЗаказной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКомплектующих</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пожелания</name>
    <attributes>
      <name>Отправитель</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/ПризнакиДоставки/ПризнакиДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПризнакиДоставки</name>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>НеОтгружен</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>ТоварВтк</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыДоставки/ТипыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДоставки</name>
  <enumValues>
    <name>Доставка</name>
  </enumValues>
  <enumValues>
    <name>ТранспортнаяКомпания</name>
  </enumValues>
  <enumValues>
    <name>Самовывоз</name>
  </enumValues>
  <enumValues>
    <name>Перегруз</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыЗавокНаОтргузку/ВидыЗавокНаОтргузку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗавокНаОтргузку</name>
  <enumValues>
    <name>Предварительная</name>
  </enumValues>
  <enumValues>
    <name>Окончательная</name>
  </enumValues>
  <enumValues>
    <name>Отгруженная</name>
  </enumValues>
  <enumValues>
    <name>Вспомогательная</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаявкаНаОтгрузку/ObjectModule.bsl
Перем НачСостНакладной;
//крохин начало 17.11.2013
Перем ТаблицаНомеровСФ;
//крохин конец 17.11.2013
//Кухарь 22.01.18 начало   
//будем записывать ЗОГ в закрытом периоде
Перем НеКонтролироватьЗапись;
//Кухарь 22.01.18 конец

//Кухарь 22.01.18 начало   
//будем записывать ЗОГ в закрытом периоде
//Кухарь 02.06.17 конец

//Кухарь 11.01.19 начало
//Для отработки коррекция
Процедура ЗаписьБезКонтроляПолномочий ()   экспорт
	если дата>Константы.ДатаЗапретаРедактирования.Получить() тогда
		НеКонтролироватьЗапись = Истина;
	иначе
		НеКонтролироватьЗапись = ложь;
	КонецЕсли;	
	Записать(?(Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
	НеКонтролироватьЗапись = Ложь;	
КонецПроцедуры
//Кухарь 11.01.19 конец


Процедура ПерезаписатьДокументБезКонтроля() Экспорт
	НеКонтролироватьЗапись=Истина;	
	Записать(?(Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
	НеКонтролироватьЗапись=Ложь;	
КонецПроцедуры 

//Кухарь 22.01.18 конец

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//кухарь 27.02.14 установка значения статуса доставки начало  
	//если ЭтоНовый() тогда
	для Каждого строчка из Накладные цикл
		если строчка.СтатусДоставки=Перечисления.ПризнакиДоставки.ПустаяСсылка() тогда
			строчка.СтатусДоставки=Перечисления.ПризнакиДоставки.НеОтгружен
		КонецЕсли;
	КонецЦикла; 
	//КонецЕсли;
	//кухарь 27.02.14 установка значения статуса доставки конец	
	ЕстьИзменения		=Модифицированность();
	
	//Кухарь 22.01.18 начало   
	//будем записывать ЗОГ в закрытом периоде
	если НеКонтролироватьЗапись <> Истина тогда
		//Кухарь 22.01.18 конец
		
		Если НЕ ОбменДанными.Загрузка Тогда		
			КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
			МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
			МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
			
			Если Отказ Тогда Возврат КонецЕсли;
		КонецЕсли;	
		
		Если НЕ ЕстьИзменения Тогда Возврат КонецЕсли;		
		//Кухарь 22.01.18 начало   
		//будем записывать ЗОГ в закрытом периоде
	КонецЕсли;
	//Кухарь 22.01.18 конец
	
	
	ДатаОтгрузки		= Дата;
	СуммаДокумента      = Накладные.Итог("СуммаДокумента");
	ОбъемДокумента		= Накладные.Итог("Объем");
	КоличествоДокумента = Накладные.Итог("Количество");
	//ГруппыТоваров		= ГруппыТоваровДокумента(ЭтотОбъект);	
	
	// Кухарь А.Ю.  22.05.2023 начало
	//Отменяется регистрация изменений текущей базы если загружаются другие изменения.
	//  	если не ОбменДанными.Загрузка тогда	
	//	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	//КонецЕсли;
	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	// Кухарь А.Ю.  22.05.2023 конец

	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
	
	ВидОснования	= Основание.Метаданные().Имя;
	
	ДокОснование	= Основание;	
	ИБ				= Основание.ИБ;
	
	Организация		= ПолучитьРеквизитОбъекта(ДокОснование,"Организация");
	Подразделение	= ПолучитьРеквизитОбъекта(ДокОснование,"Подразделение");
	
	Комментарий=Комментарий+ДокОснование.Метаданные()+" № " + ДокОснование.Номер + " от " + Формат(ДокОснование.Дата,"ДФ=dd.MM.yy");		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Организация			=Неопределено;
	СостояниеНакладной	=Неопределено;
	Отгружен			=Неопределено;
	СостояниеДокументов	=Неопределено;
	ДатаОтгрузки		=Неопределено;
	
	Автор				=Неопределено;
КонецПроцедуры

Процедура ЗаполнитьАдрес(СтрокаТЧ,ВидАдреса="Получатель",Накладная,ПунктДоставки,ТранспортнаяКомпания,ПунктПерегруза)
	//Кухарь 04.05.18 начало
	//Тип доставки теперь есть в документе
	//	ТипДоставки						=ПунктДоставки.ТипДоставки;	
	попытка
		если ЗначениеЗаполнено(Накладная.ТипДоставки) тогда
			ТипДоставки=Накладная.ТипДоставки;
		иначе
			ТипДоставки=ПунктДоставки.ТипДоставки;
		КонецЕсли;
	Исключение
		ТипДоставки=ПунктДоставки.ТипДоставки;
	КонецПопытки;
	//Кухарь 04.05.18 конец	
	
	
	СтрокаТЧ.ТипДоставки			=ТипДоставки;
	
	Если 1=2 Тогда
		СтрокаТЧ=Накладные.Добавить();	
	КонецЕсли; 
	
	Если ТипДоставки		= Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
		СтрокаТЧ["ПунктДоставки"		+ВидАдреса]	= ПунктДоставки;
		СтрокаТЧ["ПунктПерегруза"		+ВидАдреса]	= ПунктПерегруза;		
		СтрокаТЧ["ТранспортнаяКомпания"	+ВидАдреса]	= ТранспортнаяКомпания;		
		//Кухарь 06.02.18 начало
		//Новое тип доставки 
		//ИначеЕсли ТипДоставки	= Перечисления.ТипыДоставки.Доставка Тогда		
	ИначеЕсли ТипДоставки	= Перечисления.ТипыДоставки.Доставка 	или ТипДоставки=Перечисления.ТипыДоставки.Перегруз  Тогда				
		//Кухарь 06.02.18 конец				
		СтрокаТЧ["ПунктДоставки"		+ВидАдреса]	= ПунктДоставки;
		СтрокаТЧ["ПунктПерегруза"		+ВидАдреса]	= Неопределено;		
		СтрокаТЧ["ТранспортнаяКомпания"	+ВидАдреса]	= Неопределено;
	Иначе
		//СтрокаТЧ.СкладСамовывоза				= СтрокаТЧ.Отправитель;
		
		Если ПунктДоставки.СкладСамовывоза.Пустая() Тогда
			СтрокаТЧ.СкладСамовывоза				= СтрокаТЧ.Отправитель;
		Иначе
			СтрокаТЧ.СкладСамовывоза				= ПунктДоставки.СкладСамовывоза;
		КонецЕсли;
	КонецЕсли;
	
	
	СтрокаТЧ["РайонДоставки"+ВидАдреса]= ПунктДоставки.РайонДоставки;
	
	Адрес="";
	
	Если ТипДоставки=Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда			
		ПД=ПунктПерегруза;			
		
		Адрес="АД (ТК): "+СокрЛП(ТранспортнаяКомпания.Наименование)+
		", адрес: "+СокрЛП(ПД.Регион)+", "+СокрЛП(ПД.АдресПолучателя)+
		?(ПустаяСтрока(ПД.Телефоны),"",", тел.: "+ПД.Телефоны)+" "+СокрЛП(ПД.КонтактныеЛица)
		+" "+Символы.ПС;
		
		СтрокаТЧ["РайонДоставки"+ВидАдреса]	= ПД.РайонДоставки;
	ИначеЕсли ТипДоставки=Перечисления.ТипыДоставки.Доставка  Тогда		
		
		ПД=ПунктДоставки;
		
		Адрес= "АД: "+СокрЛП(СтрокаТЧ[ВидАдреса].Наименование)+
		", адрес: "+СокрЛП(ПД.Регион)+", "+СокрЛП(ПД.АдресПолучателя)+" "+Символы.ПС;
		
		СтрокаТЧ["РайонДоставки"+ВидАдреса]	= ПД.РайонДоставки;
		//Кухарь 06.02.18 начало
		//Новый тип доставки 	
	ИначеЕсли ТипДоставки=Перечисления.ТипыДоставки.Перегруз  Тогда	
		ПД=ПунктДоставки;
		
		//Кухарь 22.06.18 начало
		//Какая то ошибка иногда
		попытка
			Адрес= "АД: "+СтрокаТЧ.Накладная.АдресПерегруза+" "+Символы.ПС;
		Исключение
			Адрес= "АД: "+СокрЛП(СтрокаТЧ[ВидАдреса].Наименование)+
			", адрес: "+СокрЛП(ПД.Регион)+", "+СокрЛП(ПД.АдресПолучателя)+" "+Символы.ПС;
			
		КонецПопытки;
		//Кухарь 22.06.18  конец		
		СтрокаТЧ["РайонДоставки"+ВидАдреса]	= ПД.РайонДоставки;
		
		//Кухарь 06.02.18 конец	
		
		СтрокаТЧ["РайонДоставки"+ВидАдреса]	= ПД.РайонДоставки;
		
		//Кухарь 06.02.18 конец			
	Иначе
		ПД=ПунктДоставки;
		Адрес="АД: САМОВЫВОЗ. Склад вывоза: "+СтрокаТЧ.СкладСамовывоза+", адрес: "+СтрокаТЧ.СкладСамовывоза.Адрес+Символы.ПС;
		
	КонецЕсли;
	
	Если ТипДоставки<>Перечисления.ТипыДоставки.Самовывоз Тогда
		ПД=ПунктДоставки;		
		Адрес=Адрес+"АП: "+СокрЛП(ПД.Регион)+", "+СокрЛП(ПД.АдресПолучателя)+?(ПустаяСтрока(ПД.Телефоны),"",", тел.: "+ПД.Телефоны)+" "+СокрЛП(ПД.КонтактныеЛица);
	КонецЕсли;	
	СтрокаТЧ["Адрес"+ВидАдреса]=Адрес;
КонецПроцедуры


//Катаев+ 09/10/14 Для РМТ передаем в качестве параметра и РНК для заполнения части реквизитов оттуда
//Процедура ЗаполнитьСтрокуПоНакладной(СтрокаТЧ,Накладная) Экспорт	
Процедура ЗаполнитьСтрокуПоНакладной(СтрокаТЧ,Накладная, РНК = Неопределено) Экспорт	
	Если Накладная=Неопределено ИЛИ НЕ ЗначениеЗаполнено(Накладная.Номер) Тогда Возврат КонецЕсли; 
	
	СтрокаТЧ.Накладная			=Накладная;	
	//крохин начало
	//Катаев+ 08/10/14
	//СтрокаТЧ.Менеджер = Накладная.Менеджер;
	Если ТипЗнч(СтрокаТЧ.Накладная) <> Тип("ДокументСсылка.РасходМатериаловИТары") Тогда
		СтрокаТЧ.Менеджер = Накладная.Менеджер;
	Иначе
		СтрокаТЧ.Менеджер = Накладная.Контрагент.Менеджер;
	КонецЕсли;
	//Катаев- 08/10/14
	//крохин конец
	//кухарь 12.09.14 начало
	//теперь будет браться не из реквизитов документа, а из регистра "РеквизитыДокументов"	
	ОбИКол=ПолучитьКоличествоИОбъемКоробовИзРегистра(Накладная);
	//кухарь 12.09.14 конец	
	СтрокаТЧ.СостояниеНакладной	=Накладная.СостояниеНакладной;
	Если (ТипЗнч(СтрокаТЧ.Накладная)=Тип("ДокументСсылка.РасходнаяНакладная")) ИЛИ (ТипЗнч(СтрокаТЧ.Накладная)=Тип("ДокументСсылка.Перемещение")) Тогда
		//Кухарь 14.11.19 начало
		//Тоже будем писать в ЗОГе, чтобы при необходимости изменений объёма паллет в закрытом периоде менять в ЗОГе, а не в накладных.
		СтрокаТЧ.ОбъемПаллет=Накладная.ОбъемПаллет;
		//Кухарь 14.11.19 конец 	
		
		Если СтрокаТЧ.СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке
			//крохин начало 16.02.2012
			//новое состояние
			ИЛИ  СтрокаТЧ.СостояниеНакладной=Перечисления.СостоянияНакладной.ДопОбработка 
			//крохин конец 16.02.2012
			ИЛИ  СтрокаТЧ.СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКПриемке 
			ИЛИ  СтрокаТЧ.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена
			ИЛИ  СтрокаТЧ.СостояниеНакладной=Перечисления.СостоянияНакладной.Принята Тогда
			//кухарь 12.09.14 начало
			//теперь будет браться не из реквизитов документа, а из регистра "РеквизитыДокументов"
			//СтрокаТЧ.Объем				=Накладная.ОбъемКоробов;
			если ОбИКол<>Неопределено тогда
				СтрокаТЧ.Объем=ОбИКол.ОбъемКоробов;
			иначе
				СтрокаТЧ.Объем=999;
			КонецЕсли;
			//кухарь 12.09.14 конец
		КонецЕсли;	
	ИначеЕсли (ТипЗнч(СтрокаТЧ.Накладная)=Тип("ДокументСсылка.ЗаявкаВТранспортныйОтдел")) Тогда
		//кухарь 12.09.14 начало
		//теперь будет браться не из реквизитов документа, а из регистра "РеквизитыДокументов"
		//СтрокаТЧ.Объем				=Накладная.ОбъемКоробов;
		если ОбИКол<>Неопределено тогда
			СтрокаТЧ.Объем=ОбИКол.ОбъемКоробов;
		иначе
			СтрокаТЧ.Объем=999;
		КонецЕсли;
		//кухарь 12.09.14 конец		
	КонецЕсли;
	
	//ЕстьРеквизитДокумента(ИмяРеквизита, МетаданныеДокумента) Экспорт
	МетаданныеНакладной			=Накладная.Метаданные();
	
	Если СтрокаТЧ.Объем=0 И ЕстьРеквизитДокумента("ОбъемДокумента",Накладная.Метаданные()) Тогда			
		СтрокаТЧ.Объем=Накладная.ОбъемДокумента;	
	КонецЕсли; 
	
	//Катаев+ 08/10/14
	//СтрокаТЧ.Количество         =Накладная.КоличествоДокумента;
	Если ТипЗнч(СтрокаТЧ.Накладная) <> Тип("ДокументСсылка.РасходМатериаловИТары") Тогда
		СтрокаТЧ.Количество         =Накладная.КоличествоДокумента;
	Иначе
		СтрокаТЧ.Количество         =Накладная.Товары.Итог("Количество");
	КонецЕсли;
	//Катаев- 08/10/14
	
	//кухарь 12.09.14 начало
	//теперь будет браться не из реквизитов документа, а из регистра "РеквизитыДокументов"	
	//СтрокаТЧ.КоличествоКоробок	=Накладная.КоличествоКоробок;
	если ОбИКол<>Неопределено тогда
		СтрокаТЧ.КоличествоКоробок=ОбИКол.КоличествоКоробок;
	иначе
		СтрокаТЧ.КоличествоКоробок=99999;
	КонецЕсли;	
	//кухарь 12.09.14 конец	
	
	
	
	СтрокаТЧ.Комментарий		=Накладная.Комментарий;	
	Попытка
		СтрокаТЧ.СуммаДокумента     =Накладная.СуммаДокумента;
	Исключение КонецПопытки;
	Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ДатаРегистрации) Тогда
		СтрокаТЧ.ДатаРегистрации=ТекущаяДата();	
	КонецЕсли;
	
	СтрокаТЧ.НомерНакладной		=Накладная.Номер;
	СтрокаТЧ.ДатаНакладной		=Накладная.Дата;		
	
	ВидНакладной				=МетаданныеНакладной.Имя;
	ПредставлениеВида			=""+МетаданныеНакладной;
	СтрокаТЧ.ВидНакладной		=ПредставлениеВида;	
	
	Если ЕстьРеквизитДокумента("Организация",МетаданныеНакладной) Тогда
		СтрокаТЧ.Организация=Накладная.Организация;	
	КонецЕсли; 
	
	Если 1=2 Тогда
		СтрокаТЧ=Накладные.Добавить();	
	КонецЕсли; 
	
	Если НачалоДня(Накладная.ДатаОтгрузки)<>НачалоДня(Дата) Тогда
		СтрокаТЧ.НеОтгружать=Истина;		
	КонецЕсли; 
	
	Если ВидНакладной="РасходнаяНакладная" Тогда	
		Если 1=2 Тогда
			Накладная=Документы.РасходнаяНакладная.СоздатьДокумент();		
		КонецЕсли; 
		
		  // Кухарь А.Ю. 01.03.2022 начало
		  //
		  СтрокаТЧ.КоличествоКомплектующих=Накладная.КоличествоКомплектующих;
		  // Кухарь А.Ю. 01.03.2022 конец
		  
		
		СтрокаТЧ.Отправитель			=Накладная.Склад;	
		СтрокаТЧ.АдресОтправитель   	=Накладная.Склад.Адрес;
		
		СтрокаТЧ.Получатель				=Накладная.Контрагент;			
		
		СтрокаТЧ.ТранспортнаяКомпанияПолучатель	=Накладная.ТранспортнаяКомпания;
		
		
		//Кухарь 10.02.16 начало
		//Сначала будет проверятся нет ли времени доставки на конкретно эту накладную
		//СтрокаТЧ.ВремяПриемки		=Накладная.ПунктДоставки.ВремяДоставки;
		ВремяДоставки=ПолучитьВремяПриемки(Накладная);
		если ВремяДоставки=Справочники.ВремяПриемки.ПустаяСсылка() или ВремяДоставки=Неопределено тогда
			СтрокаТЧ.ВремяПриемки		=Накладная.ПунктДоставки.ВремяДоставки;
		иначе
			СтрокаТЧ.ВремяПриемки		=ВремяДоставки;
		КонецЕсли;
		//Кухарь 10.02.16 конец	
		
		//кухарь 11.07.14 начало
		//СтрокаТЧ.ДатаПриемки		=Накладная.ДатаПриемки;
		СтрокаТЧ.ДатаПриемки		=ОпределитьДатуАвизацииДокумента(Накладная);
		//кухарь 11.07.14 конец
		
		
		СтрокаТЧ.Регион							=Накладная.Регион;
		Если ЗначениеЗаполнено(СтрокаТЧ.Регион) Тогда
			СтрокаТЧ.Регион				=Накладная.ПунктДоставки.Регион;					
		КонецЕсли; 
		
		ЗаполнитьАдрес(СтрокаТЧ,"Получатель",Накладная,Накладная.ПунктДоставки,Накладная.ТранспортнаяКомпания,Накладная.ПунктПерегруза);		
		
		//мессерле 28,03,12
		СтрокаТч.ТранспортныйОтдел=СтрокаТч.Получатель.ТранспортныйОтдел;
		если Накладная.ЗабратьДеньги  тогда
			СтрокаТч.ТранспортныйОтдел=справочники.Контрагенты.НайтиПоКоду("SSR-1612"); //Кб стиль- инфернальный косяк с настройками отчета заявка на отгрузку
		Конецесли;
		//мессерле 28,03,12
		
		//кухарь 12.02.14 начало
		СтрокаТЧ.СуммаДокументаБезНДС=Накладная.Товары.Итог("Сумма");	
		//кухарь 12.02.14 конец
	ИначеЕсли ВидНакладной="ПриходнаяНакладная" Тогда
		
		//кухарь 25.02.13 начало
		//кухарь 15.03.13 дата авизации тек днем не нужна начало 
		//кухарь 11.07.14 начало
		//если Накладная.ПунктДоставки.ДнейВпути>0 тогда
		//СтрокаТЧ.ДатаПриемки		=Накладная.ДатаПриемки;
		//КонецЕсли;
		СтрокаТЧ.ДатаПриемки		=ОпределитьДатуАвизацииДокумента(Накладная);
		//кухарь 11.07.14 конец
		//кухарь 15.03.13 дата авизации тек днем не нужна конец
		
		//кухарь 25.02.13 конец
		
		
		
		//Кухарь 10.02.16 начало
		//Сначала будет проверятся нет ли времени доставки на конкретно эту накладную
		//СтрокаТЧ.ВремяПриемки		=Накладная.ПунктДоставки.ВремяДоставки;
		ВремяДоставки=ПолучитьВремяПриемки(Накладная);
		если ВремяДоставки=Справочники.ВремяПриемки.ПустаяСсылка() или ВремяДоставки=Неопределено тогда
			СтрокаТЧ.ВремяПриемки		=Накладная.ПунктДоставки.ВремяДоставки;
		иначе
			СтрокаТЧ.ВремяПриемки		=ВремяДоставки;
		КонецЕсли;
		//Кухарь 10.02.16 конец	
		
		СтрокаТЧ.Отправитель		=Накладная.Контрагент;	
		СтрокаТЧ.АдресПолучатель	=Накладная.Склад.Адрес;
		//крохин начало
		//в ПНК используем ТК и факт. адрес ТК
		//ЗаполнитьАдрес(СтрокаТЧ,"Отправитель",Накладная,Накладная.ПунктДоставки,Справочники.Контрагенты.ПустаяСсылка(),Справочники.ПунктыДоставки.ПустаяСсылка());
		СтрокаТЧ.Регион				=Накладная.ПунктДоставки.Регион;
		ЗаполнитьАдрес(СтрокаТЧ,"Отправитель",Накладная,Накладная.ПунктДоставки,Накладная.ТранспортнаяКомпания,Накладная.ПунктПерегруза);
		//крохин конец
		
		СтрокаТЧ.Получатель			=Накладная.Склад;	
		//кухарь 12.02.14 начало
		СтрокаТЧ.СуммаДокументаБезНДС=Накладная.Товары.Итог("Сумма");
		//кухарь 12.02.14 конец
		
	ИначеЕсли ВидНакладной="Перемещение" Тогда
		//кухарь 25.02.13 начало
		//кухарь 15.03.13 дата авизации тек днем не нужна начало
		
		//кухарь 11.07.14 начало
		СтрокаТЧ.ДатаПриемки		=ОпределитьДатуАвизацииДокумента(Накладная);
		//кухарь 11.07.14 конец
		
		//кухарь 25.02.13 конец
		
		//Кухарь 10.02.16 начало
		//Сначала будет проверятся нет ли времени доставки на конкретно эту накладную
		//СтрокаТЧ.ВремяПриемки		=Накладная.ПунктДоставки.ВремяДоставки;
		ВремяДоставки=ПолучитьВремяПриемки(Накладная);
		если ВремяДоставки=Справочники.ВремяПриемки.ПустаяСсылка() или ВремяДоставки=Неопределено тогда
			СтрокаТЧ.ВремяПриемки		=Накладная.ПунктДоставки.ВремяДоставки;
		иначе
			СтрокаТЧ.ВремяПриемки		=ВремяДоставки;
		КонецЕсли;
		//Кухарь 10.02.16 конец	
		
		
		
		Если 1=2 Тогда
			Накладная=Документы.Перемещение.СоздатьДокумент();		
		КонецЕсли; 
		СтрокаТЧ.Отправитель		=Накладная.Склад;	
		СтрокаТЧ.АдресОтправитель   =Накладная.Склад.Адрес;
		СтрокаТЧ.Получатель			=Накладная.СкладПолучатель;
		//кухарь 12.02.14 начало
		СтрокаТЧ.СуммаДокументаБезНДС=Накладная.Товары.Итог("Сумма");
		//кухарь 12.02.14 конец
		
		ЗаполнитьАдрес(СтрокаТЧ,"Получатель",Накладная,Накладная.ПунктДоставки,Накладная.ПунктДоставки.ТраспортнаяКомпания,Накладная.ПунктДоставки.ПунктПерегруза);
	ИначеЕсли ВидНакладной="ЗаявкаВТранспортныйОтдел" Тогда
		Если 1=2 Тогда
			Накладная=Документы.ЗаявкаВТранспортныйОтдел.СоздатьДокумент();		
		КонецЕсли; 		
		
		СтрокаТЧ.Отправитель				= Накладная.Отправитель;
		СтрокаТЧ.ПунктДоставкиОтправитель   = Накладная.ПунктДоставкиОтправитель;
		
		СтрокаТЧ.Получатель					=Накладная.Получатель;
		СтрокаТЧ.ПунктДоставкиПолучатель	=Накладная.ПунктДоставкиПолучатель;
		
		ЗаполнитьАдрес(СтрокаТЧ,"Получатель",	Накладная,Накладная.ПунктДоставкиПолучатель,Накладная.ТранспортнаяКомпанияПолучатель,Накладная.ПунктПерегрузаПолучатель);
		ЗаполнитьАдрес(СтрокаТЧ,"Отправитель",	Накладная,Накладная.ПунктДоставкиОтправитель,Накладная.ТранспортнаяКомпанияОтправитель,Накладная.ПунктПерегрузаОтправитель);
		//кухарь 12.02.14 начало
		СтрокаТЧ.СуммаДокументаБезНДС=0;
		//кухарь 12.02.14 конец
		//кухарь 14.11.16 начало
		СтрокаТЧ.ДатаПриемки		=ОпределитьДатуАвизацииДокумента(Накладная);
		//кухарь 14.11.16 конец
		
		//Катаев+ 08/10/14	
	ИначеЕсли ВидНакладной="РасходМатериаловИТары" Тогда
		СтрокаТЧ.Отправитель		=Накладная.Склад;	
		СтрокаТЧ.АдресОтправитель   =Накладная.Склад.Адрес;
		СтрокаТЧ.Получатель			=Накладная.Контрагент;
		СтрокаТЧ.ПунктДоставкиПолучатель	=Накладная.ПунктДоставки;
		СтрокаТЧ.СуммаДокументаБезНДС=Накладная.Товары.Итог("Сумма");
		СтрокаТЧ.КоличествоКоробок=0;
		ЗаполнитьАдрес(СтрокаТЧ,"Получатель",Накладная,Накладная.ПунктДоставки,Накладная.ПунктДоставки.ТраспортнаяКомпания,Накладная.ПунктДоставки.ПунктПерегруза);
		СтрокаТЧ.ТранспортнаяКомпанияПолучатель	=РНК.ТранспортнаяКомпания;
		
		//Кухарь 10.02.16 начало
		//Сначала будет проверятся нет ли времени доставки на конкретно эту накладную
		//СтрокаТЧ.ВремяПриемки		=РНК.ПунктДоставки.ВремяДоставки;
		ВремяДоставки=ПолучитьВремяПриемки(рнк);
		если ВремяДоставки=Справочники.ВремяПриемки.ПустаяСсылка() или ВремяДоставки=Неопределено тогда
			СтрокаТЧ.ВремяПриемки		=РНК.ПунктДоставки.ВремяДоставки;
		иначе
			СтрокаТЧ.ВремяПриемки		=ВремяДоставки;
		КонецЕсли;
		//Кухарь 10.02.16 конец			
		
		СтрокаТЧ.ДатаПриемки		=ОпределитьДатуАвизацииДокумента(РНК);
		
		
		СтрокаТЧ.Регион				=РНК.Регион;
		Если ЗначениеЗаполнено(СтрокаТЧ.Регион) Тогда
			СтрокаТЧ.Регион				=РНК.ПунктДоставки.Регион;					
		КонецЕсли; 
		СтрокаТч.ТранспортныйОтдел=СтрокаТч.Получатель.ТранспортныйОтдел;
		Если не РНК.Проведен тогда
			СтрокаТЧ.НеОтгружать=Истина;
		КонецЕсли;
		//Катаев- 08/10/14
	КонецЕсли;	
	//кухарь 01.08.14 конец
	
	// Кухарь А.Ю.  04.10.2022 начало
	// если не Накладная.Проведен тогда
	если не Накладная.Проведен или СтрокаТЧ.СостояниеНакладной=Перечисления.СостоянияНакладной.Отменена тогда	 
		// Кухарь А.Ю.  04.10.2022 конец
		
		СтрокаТЧ.НеОтгружать=Истина;
	КонецЕсли;
	//кухарь 01.08.14 начало
	
КонецПроцедуры

Процедура ОбновитьСостоянияНакладных() Экспорт
	//крохин начало 17.11.2013
	//получим номера СФ
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СчетФактураНакладные.Ссылка.Номер КАК НомерСФ,
	|	СчетФактураНакладные.Накладная.Номер КАК НомерРНК
	|ИЗ
	|	Документ.СчетФактура.Накладные КАК СчетФактураНакладные
	|ГДЕ
	|	СчетФактураНакладные.Накладная В(&СписокНакладных)
	|	И СчетФактураНакладные.Ссылка.Проведен";
	Запрос.УстановитьПараметр("СписокНакладных",Накладные.ВыгрузитьКолонку("Накладная"));
	ТаблицаНомеровСФ = Запрос.Выполнить().Выгрузить();
	
	//крохин конец 17.11.2013
	Для Каждого СтрокаТЧ Из Накладные Цикл
		Если НЕ СтрокаТЧ.Накладная.Пустая() И НЕ ЗначениеНеЗаполнено(СтрокаТЧ.Накладная.Номер) Тогда
			ЗаполнитьСтрокуПоНакладной(СтрокаТЧ,СтрокаТЧ.Накладная);
			//крохин начало 17.11.2013
			Если ТаблицаНомеровСФ <> Неопределено И СтрокаТЧ.Накладная.Метаданные().имя = "РасходнаяНакладная" Тогда
				НайденнаяСтрока = ТаблицаНомеровСФ.Найти(СтрокаТЧ.НомерНакладной,"НомерРНК");
				Если НайденнаяСтрока = Неопределено Тогда
					СтрокаТЧ.НомерСФ = "";	
				Иначе
					СтрокаТЧ.НомерСФ = НайденнаяСтрока.НомерСФ;
				КонецЕсли;
			КонецЕсли;
			//крохин конец 17.11.2013
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры


Процедура  ОбновитьСостояниеПаллет() Экспорт
	
	 //Тимофеев Ю.А. 17.08.2023 Начало
	
	//получим все ПНК у который в табличной части 
	//1 строка с Паллетами на возрат от покупателя
	//и аналогично добавим в табличную часть ЗОГ
	//в верхнем ЗАПРОСЕ они не подадают 
	//так как имеют СостоянияНакладной = СостоянияНакладной.Принята
	
	//а можно было вот так сделать
	//////Тимомфеев Ю.А.
	//|И ВЫБОР
	//|КОГДА Накладная.КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя)
	//|	ТОГДА ИСТИНА
	//|ИНАЧЕ НЕ Накладная.СостояниеНакладной В (&СписокНедопустимыхСостояний)
	//| КОНЕЦ";
	//////Тимомфеев Ю.А.
	
		
	ТоварПаллеты = Справочники.Номенклатура.НайтиПоКоду("ODB-000325"); 
	
	
	ЗапросП = Новый Запрос;
	ЗапросП.Текст = "ВЫБРАТЬ
	|	ПриходнаяНакладнаяТовары.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ПНСсПАЛЕТТАМИ
	|ИЗ
	|	Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
	|ГДЕ
	|	ПриходнаяНакладнаяТовары.Номенклатура = &Номенклатура
	|	И ПриходнаяНакладнаяТовары.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И ПриходнаяНакладнаяТовары.Ссылка.Проведен
	|	И ПриходнаяНакладнаяТовары.Ссылка.Склад = &Склад
	|	И ПриходнаяНакладнаяТовары.Ссылка.ДатаОтгрузки = &ДатаОтгрузки
	|	И ПриходнаяНакладнаяТовары.Ссылка.КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя)
	|	И ПриходнаяНакладнаяТовары.Ссылка.ПунктДоставки.ТребуетсяЗабиратьПалетты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриходнаяНакладнаяТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(1) КАК СчетСтрок,
	|	ПриходнаяНакладнаяТовары.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТолькоПаллеты
	|ИЗ
	|	Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
	|ГДЕ
	|	ПриходнаяНакладнаяТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ПНСсПАЛЕТТАМИ.Ссылка КАК Ссылка
	|			ИЗ
	|				ПНСсПАЛЕТТАМИ КАК ПНСсПАЛЕТТАМИ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриходнаяНакладнаяТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""ПНК"" КАК Вид,
	|	ТолькоПаллеты.Ссылка КАК Ссылка
	|ИЗ
	|	ТолькоПаллеты КАК ТолькоПаллеты
	|ГДЕ
	|	ТолькоПаллеты.СчетСтрок = 1";

	
	ЗапросП.УстановитьПараметр("Номенклатура", ТоварПаллеты);// Номенклатура
	ЗапросП.УстановитьПараметр("Дата1"       , КонецДня(Константы.ДатаЗапретаРедактирования.Получить()));
	ЗапросП.УстановитьПараметр("Дата2",		   КонецДня(Дата));
	ЗапросП.УстановитьПараметр("Склад",		   Склад);
	ЗапросП.УстановитьПараметр("ДатаОтгрузки", НачалоДня(Дата));
	
	
	ВыборкаП=ЗапросП.Выполнить().Выбрать();
	
	//сократим немного Тимофеев Ю.А.
	ОбъектПолученныйПоСсылке = Ссылка.ПолучитьОбъект();
	ПеречВспомогательная     = Перечисления.ВидыЗавокНаОтргузку.Вспомогательная;
	
	Пока ВыборкаП.Следующий() Цикл		
		СтрокаТЧ=Накладные.Найти(ВыборкаП.Ссылка,"Накладная");
		
		Если СтрокаТЧ=Неопределено Тогда
			
			СтрокаТЧ=Накладные.Добавить();
			
			//кухарь 15.03.15 начало
			//будем галку снимать если зог был или стал вспомогательным. Их могут формировать логисты заранее. 
		ИначеЕсли ссылка <> Документы.ЗаявкаНаОтгрузку.ПустаяСсылка() тогда
			//Кухарь 25.05.17 начало
			//Опечатка
			//если ДокОбъект.Ссылка.ПолучитьОбъект().ВидЗаявки<>Перечисления.ВидыЗавокНаОтргузку.Вспомогательная или  ДокОбъект.ВидЗаявки<>Перечисления.ВидыЗавокНаОтргузку.Вспомогательная тогда
			ТекущаяНакладная=СтрокаТЧ.Накладная; 
			
			//Тимофеев Ю.А. 21.08.2023 Начало
			СтрокаТЧ.НеОтгружать= ТекущаяНакладная.Проведен;			
			//Тимофеев Ю.А. 21.08.2023 Конец
			
			если ОбъектПолученныйПоСсылке.ВидЗаявки=ПеречВспомогательная или  ВидЗаявки=ПеречВспомогательная тогда
				//Кухарь 25.05.17 начало     				
								
				если  ТекущаяНакладная.СостояниеНакладной<>Перечисления.СостоянияНакладной.ВРаботе и  ТекущаяНакладная.Проведен и  ТекущаяНакладная.ДатаОтгрузки=ДатаОтгрузки тогда
					СтрокаТЧ.НеОтгружать=Ложь;
				КонецЕсли;
				
			КонецЕсли;		
			//кухарь 15.03.15 конец
		КонецЕсли;
		
		ЗаполнитьСтрокуПоНакладной(СтрокаТЧ,ВыборкаП.Ссылка);
		
	КонецЦикла;
	
	//ПНК с возратными паллетами
	//Тимофеев Ю.А. 17.08.2023 Конец

	
КонецПроцедуры




ЗаписьБезКонтроля=Ложь;
